task/task-c/openfoam/task-14/init_file/snappy_base/system/snappyHexMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    object snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    cylinder
    {
        type triSurfaceMesh;
        file "cylinder.stl";
    }
}

castellatedMeshControls
{
    maxLocalCells 200000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    nCellsBetweenLevels 2;

    features ();

    refinementSurfaces
    {
        cylinder
        {
            level (4 5); // TODO_SNAPPY_LEVELS
            patchInfo
            {
                type wall;
            }
        }
    }

    refinementRegions {};
    insidePoint (0.5 0.5 0.0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 15;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        cylinder
        {
            nSurfaceLayers 3; // TODO_N_SURFACE_LAYERS
        }
    }
    expansionRatio 1.2;
    finalLayerThickness 0.4;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
}

meshQualityControls
{
    #include "meshQualityDict"
}

mergeTolerance 1e-6;
